; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
;  - remove the road predicate to allow fully connected graph
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (not (at ?v ?l2))
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=4, packages=5, locations=9, density=1.0, fully_connected=True, max_capacity=2, out_folder=./full/training, instance_id=32, seed=73

(define (problem transport-32)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l8)
    (at p2 l5)
    (at p3 l2)
    (at p4 l8)
    (at p5 l7)
    (at v1 l9)
    (at v2 l9)
    (at v3 l4)
    (at v4 l8)
    )
 (:goal  (and 
    (at p1 l2)
    (at p2 l1)
    (at p3 l5)
    (at p4 l7)
    (at p5 l1))))

; plan
1. (drive v3 l4 l8)
   deleted: (at v3 l4)
   added: (at v3 l8)
   goals met: 0 of 5
2. (pick-up v3 l8 p4 c1 c2)
   deleted: (at p4 l8) (capacity v3 c2)
   added: (in p4 v3) (capacity v3 c1)
   goals met: 0 of 5
3. (pick-up v3 l8 p1 c0 c1)
   deleted: (at p1 l8) (capacity v3 c1)
   added: (in p1 v3) (capacity v3 c0)
   goals met: 0 of 5
4. (drive v3 l8 l2)
   deleted: (at v3 l8)
   added: (at v3 l2)
   goals met: 0 of 5
5. (drop v3 l2 p1 c0 c1)
   deleted: (in p1 v3) (capacity v3 c0)
   added: (at p1 l2) (capacity v3 c1)
   goals met: 1 of 5
6. (pick-up v3 l2 p3 c0 c1)
   deleted: (at p3 l2) (capacity v3 c1)
   added: (in p3 v3) (capacity v3 c0)
   goals met: 1 of 5
7. (drive v3 l2 l5)
   deleted: (at v3 l2)
   added: (at v3 l5)
   goals met: 1 of 5
8. (drop v3 l5 p3 c0 c1)
   deleted: (in p3 v3) (capacity v3 c0)
   added: (at p3 l5) (capacity v3 c1)
   goals met: 2 of 5
9. (pick-up v3 l5 p2 c0 c1)
   deleted: (at p2 l5) (capacity v3 c1)
   added: (in p2 v3) (capacity v3 c0)
   goals met: 2 of 5
10. (drive v3 l5 l7)
   deleted: (at v3 l5)
   added: (at v3 l7)
   goals met: 2 of 5
11. (drop v3 l7 p4 c0 c1)
   deleted: (in p4 v3) (capacity v3 c0)
   added: (at p4 l7) (capacity v3 c1)
   goals met: 3 of 5
12. (pick-up v3 l7 p5 c0 c1)
   deleted: (at p5 l7) (capacity v3 c1)
   added: (in p5 v3) (capacity v3 c0)
   goals met: 3 of 5
13. (drive v3 l7 l1)
   deleted: (at v3 l7)
   added: (at v3 l1)
   goals met: 3 of 5
14. (drop v3 l1 p2 c0 c1)
   deleted: (in p2 v3) (capacity v3 c0)
   added: (at p2 l1) (capacity v3 c1)
   goals met: 4 of 5
15. (drop v3 l1 p5 c1 c2)
   deleted: (in p5 v3) (capacity v3 c1)
   added: (at p5 l1) (capacity v3 c2)
   goals met: 5 of 5
